Autodesk.Revit.DB.Transaction.#ctor(Autodesk.Revit.DB.Document,System.String,System.Boolean)
Instantiates a transaction object.
The transaction does not start by creating a transaction object.
One of the 'Start' methods will need to be called in order to start
this transaction.
document:
The document for which this transaction is going to be used.
name:
The name of the transaction. This name will appear in the undo menu
once the transaction is successfully committed. The name must not be empty.
The name can be reset later by either calling Autodesk.Revit.DB.Transaction.SetName(System.String) or
by using the name argument in the Autodesk.Revit.DB.Transaction.Start(System.String) method.
allowStartInOtherDocs:
Flag indicating that this transaction is allowed to start in other documents, such as linked files.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name argument is an empty string.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null